[
  "1. Which is your primary browser for development",
  "2. Which of the following technologies have you made use of?",
  "3. How old are the apps you frequently work on?",
  "4. What is your typical Internet connection speed?",
  "5. Web innovation is outpacing native",
  "6. I am satisfied with the state of browser tooling for web dev",
  "7. Building for the web is becoming easier over time",
  "8. I feel safe while browsing the web",
  "9. I am satisfied with browser standards adoption",
  "10. The web is improving for end-users",
  "11. I am satisfied with the communication between the software side and the business side of my organization",
  "12. I am satisfied with the communication between the design side and the engineering side of my organization",
  "13. I am satisfied with the state of analytics tooling for the web",
  "14. I am satisfied with the state of a/b test tooling for the web",
  "15. I am satisfied with the current user interface design trends for the web",
  "16. I am familiar with the laws associated with GDPR",
  "17. The desktop web is typically slow and sluggish",
  "18. Accessibility is an important concern in my web development",
  "19. The mobile web is typically slow and sluggish",
  "20. I dislike ads on the web",
  "21. I am optimistic about the future of progressive web apps",
  "22. Artificial intelligence advancements are having a big impact on the web",
  "23. I am satisfied with the development libraries my team and I use",
  "24. Which software development roles do you assume on a regular basis?",
  "25. Which of these front-end JavaScript frameworks do you work currently work with?",
  "26. When working with CSS, which of the following do you make use of?",
  "27. How does your team/project do a/b testing in your projects?",
  "28. Which desktop operating system do you use for development?",
  "29. Does your team/project support IE 10 and under?",
  "30. Should browsers still allow users to disable JavaScript?",
  "31. Do the apps/sites you work on typically import custom fonts?",
  "32. Does your team create design mockups before coding?",
  "33. Does your team use a package manager such as npm, yarn, bower, etc.?",
  "34. Do your projects currently serve WebP-formatted images to supporting browsers?",
  "35. Does your team write code tests for front-end code?",
  "36. Does your team write code tests for back-end code?",
  "37. Do you typically practice test-driven-development?",
  "38. What is your age?",
  "39. How long have you been working in software (in years)",
  "40. Which mobile device ecosystem you use for personal use?",
  "41. What is your gender identity?",
  "42. Which of the following educational programs have you made use of?",
  "43. Are you a..."
]